Melihat berkas bawaan google colab dengan library os

In [1]:
import os
os.listdir('sample_data')

['anscombe.json',
 'README.md',
 'california_housing_test.csv',
 'mnist_train_small.csv',
 'mnist_test.csv',
 'california_housing_train.csv']

Import library Pandas

In [2]:
import pandas as pd

Mengubah berkas 'california_housing_train.csv' menjadi dataframe menggunakan fungsi read_csv() dari library pandas, kemudian simpan ke suatu variabel.

In [4]:
df = pd.read_csv('sample_data/california_housing_train.csv')

fungsi head() digunakan untuk menampilkan lima baris data teratas

In [5]:
df.head()

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0

[5 rows x 9 columns]